let courses = [
    ["數學與邏輯思維", "數學與邏輯思維", 
    "人文藝術領域", "醫學工程概論", "地景欣賞","照相機的世界",
    "能源科技概論","科學史","自然啟發設計","化妝品概論與應用",
    "跟著地科遊台灣"," 探索大氣","數位科技演進與未來趨勢","基礎雲端運算與實務"],

    ["人物與中國歷史", "中國藝術史", "社會心理學", 
    "法學緒論", "心理學概論","婚姻與家庭","智慧財產權","社會關懷",
    "全球化都市與社會空間","科技發展與社會變遷","性別教育","媒體與國際關係",
    "媒體與國際關係","歐洲史導論","勞動保障與權益解析","數位媒體素養、思考與實踐","童年文化"],

    ["戲劇欣賞", "戲劇欣賞", "鄉土音樂", "美學", "語言與邏輯",
    "日本文化概論","古典音樂欣賞","繪本賞析","世界主要宗教概論","俄羅斯思想與文化",
    "文物與文學","輕鬆優雅學易經：中華第一奇典入門","西方文明與經典","閱讀產業鏈的導覽與探索","原住民族文化概論"],

    ["生命科學概論", "中醫的科學觀", "中醫概論與中醫保健", "生物學概論", 
    "生命倫理學","飲食：人文與科學的對話","健康管理","疾病概論","食品安全與生物技術","醫學與人文",
    "生死學概論","生命與身體活動","健康、休閒與生活","生命教育概論","健康與生活"],

    ["通識講座", "古蹟文化與在地生活", "島嶼、族群與文化", 
    "在地文化導覽", "城市生活與文化敘事","旅遊桃園史","客家與台灣",]
];
